<a href="https://colab.research.google.com/github/isabelandreatta1/Unit_3/blob/main/Database_Normalisation_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Scenario

Conside the following data from a school:

| Student Name  | Fees Paid | Date of Birth | Address                             | Subject 1              | Subject 2                 | Subject 3          | Subject 4 | Teacher Name   | Teacher Address               | Course Name      |
|---------------|-----------|---------------|-------------------------------------|------------------------|---------------------------|--------------------|-----------|----------------|-------------------------------|------------------|
| John Smith    | 18-Jul-00 | 04-Aug-91     | 3 Main Street, North Boston 56125   | Economics 1 (Business) | Biology 1 (Science)       |                    |           | James Peterson | 44 March Way, Glebe 56100     | Economics        |
| Maria Griffin | 14-May-01 | 10-Sep-92     | 16 Leeds Road, South Boston 56128   | Biology 1 (Science)    | Business Intro (Business) | Programming 2 (IT) |           | James Peterson | 44 March Way, Glebe 56100     | Computer Science |
| Susan Johnson | 03-Feb-01 | 13-Jan-91     | 21 Arrow Street, South Boston 56128 | Biology 2 (Science)    |                           |                    |           | Sarah Francis  |                               | Medicine         |
| Matt Long     | 29-Apr-02 | 25-Apr-92     | 14 Milk Lane,Â South Boston 56128   |                        |                           |                    |           | Shane Cobson   | 105 Mist Road, Faulkner 56410 | Dentistry        |

## Tasks

1. Normalize this table up to **3NF** [(see slides from class here)](https://https://docs.google.com/presentation/d/1sADUiD8YFt88YvV8UyHVhhPe7ks8K8Xpp3y-WPDJ2zc/edit#slide=id.p)
1. Create the ER diagram for the normalized database.

**Table 1: Student Information**


| Student ID | Name          | Fees Paid | Date of Birth | Address                             |
|------------|---------------|-----------|---------------|-------------------------------------|
| 1          | John Smith    | 18-Jul-00 | 04-Aug-91     | 3 Main Street, North Boston 56125   |
| 2          | Maria Griffin | 14-May-01 | 10-Sep-92     | 44 March Way, Glebe 56100           |
| 3          | Susan Johnson | 03-Feb-01 | 13-Jan-91     | 21 Arrow Street, South Boston 56128 |
| 4          | Matt Long     | 29-Apr-02 | 25-Apr-92     | 14 Milk Lane,Â South Boston 56128   |

**Table 2: Teacher Information**

| Teacher ID | Name           | Teacher Address               |
|------------|----------------|-------------------------------|
| 1          | James Peterson | 44 March Way, Glebe 56100     |
| 2          | Sarah Francis  |                               |
| 3          | Shane Cobson   | 105 Mist Road, Faulkner 56410 |

**Table 3: Course Information** 

| Course ID | Course Name      |
|-----------|------------------|
| 1         | Economics        |
| 2         | Computer Science |
| 3         | Medicine         |
| 4         | Dentistry        |

**Table 4: Course-to-teacher Relationship** 

| Course and teacher ID | Course ID | Teacher ID |
|-----------------------|-----------|------------|
| 1                     | 1         | 1          |
| 2                     | 2         | 1          |
| 3                     | 3         | 2          |
| 4                     | 4         | 3          |

**Table 5: Subject Information** 

| Subject ID | Subject Name              |
|------------|---------------------------|
| 1          | Economics 1 (Business)    |
| 2          | Biology 1 (Science)       |
| 3          | Biology 2 (Science)       |
| 4          | Business Intro (Business) |
| 5          | Programming (IT)          |

**Table 6: Student to Subject Relationship**

| Student-to-subject ID | Subject 1 ID | Subject 2 ID | Subject 3 ID | Student ID |
|-----------------------|--------------|--------------|--------------|------------|
| 1                     | 1            | 2            |              | 1          |
| 2                     | 2            | 4            | 5            | 2          |
| 3                     | 3            |              |              | 3          |
| 4                     |              |              |              | 4          |

**Table 7: Student to Course relationship** 

| Student-to-course ID | Student ID | Course ID |
|----------------------|------------|-----------|
| 1                    | 1          | 1         |
| 2                    | 2          | 2         |
| 3                    | 3          | 3         |
| 4                    | 4          | 4         |

In [ ]:
CREATE TABLE IF NOT EXISTS student_info(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    name TEXT,
    fees_paid DATE,
    date_of_birth DATE,
    address VARCHAR(150));
-- reason why you put not exists because it may try to add to previous ones and create error

INSERT INTO student_info(name,fees_paid,date_of_birth,address)
VALUES ('John Smith ','18-Jul-00 ','04-Aug-91','3 Main Street, North Boston 56125');
-- delete from student_info where id = 2;
INSERT INTO student_info(name,fees_paid,date_of_birth,address)
VALUES('Maria Griffin','14-May-01','10-Sep-92','44 March Way, Glebe 56100');

INSERT INTO student_info(name,fees_paid,date_of_birth,address)
VALUES('Susan Johnson','03-Feb-01','13-Jan-91','21 Arrow Street, South Boston 56128');

INSERT INTO student_info(name, fees_paid, date_of_birth,address)
VALUES('Matt Long','29-Apr-02','25-Apr-92','14 Milk Lane,Â South Boston 56128');

CREATE TABLE IF NOT EXISTS teacher_info(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    name TEXT,
    teacher_address TEXT
);

INSERT INTO teacher_info(name, teacher_address)
VALUES ('James Peterson','44 March Way, Glebe 56100');

INSERT INTO teacher_info(name)
VALUES('Sarah Francis');

INSERT INTO teacher_info(name, teacher_address)
VALUES ('Shane Cobson','105 Mist Road, Faulkner 56410');

CREATE TABLE IF NOT EXISTS course_info(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    course_name varchar(50)
);

INSERT INTO course_info(course_name)
VALUES ('Economics');

INSERT INTO course_info(course_name)
VALUES ('Computer Science');

INSERT INTO course_info(course_name)
VALUES ('Medicine');

INSERT INTO course_info(course_name)
VALUES ('Dentistry');

CREATE TABLE IF NOT EXISTS subject_info(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    subject_name TEXT
);

INSERT INTO subject_info(subject_name)
VALUES ('Economics 1 (Business)');

INSERT INTO subject_info(subject_name)
VALUES ('Biology 1 (Science)');

INSERT INTO subject_info(subject_name)
VALUES ('Biology 2 (Science)');

INSERT INTO subject_info(subject_name)
VALUES ('Business Intro (Business)');

INSERT INTO subject_info(subject_name)
VALUES ('Programming (IT)');

CREATE TABLE IF NOT EXISTS course_to_teacher(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    course_id INTEGER NOT NULL,
    teacher_id INTEGER NOT NULL,
    FOREIGN KEY (course_id) REFERENCES course_info(ID),
    FOREIGN KEY (teacher_id) REFERENCES teacher_info(ID)
);

INSERT INTO course_to_teacher(course_id, teacher_id)
VALUES(1,1);

INSERT INTO course_to_teacher(course_id, teacher_id)
VALUES(2,1);

INSERT INTO course_to_teacher(course_id, teacher_id)
VALUES(3,2);

INSERT INTO course_to_teacher(course_id, teacher_id)
VALUES(2,4);

CREATE TABLE IF NOT EXISTS student_to_course(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    student_id INTEGER NOT NULL,
    course_id INTEGER NOT NULL,
    FOREIGN KEY (student_id) REFERENCES student_info(ID),
    FOREIGN KEY (course_id) REFERENCES course_info(ID)
);

INSERT INTO student_to_course(student_id, course_id)
VALUES (1,1);

INSERT INTO student_to_course(student_id, course_id)
VALUES (2,2);

INSERT INTO student_to_course(student_id, course_id)
VALUES (3,3);

INSERT INTO student_to_course(student_id, course_id)
VALUES (4,4);

CREATE TABLE IF NOT EXISTS student_to_subject(
    ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL ,
    student_id INTEGER NOT NULL ,
    subject1_id INTEGER,
    subject2_id INTEGER,
    subject3_id INTEGER,
    FOREIGN KEY (student_id) REFERENCES student_info(ID),
    FOREIGN KEY (subject1_id) REFERENCES subject_info(ID),
    FOREIGN KEY (subject2_id) REFERENCES subject_info(ID),
    FOREIGN KEY (subject3_id) REFERENCES subject_info(ID)
    );

INSERT INTO student_to_subject(student_id, subject1_id, subject2_id)
VALUES (1,1,2);

INSERT INTO student_to_subject(student_id, subject1_id, subject2_id, subject3_id)
VALUES(2,2,4,5);

INSERT INTO student_to_subject(student_id, subject1_id)
VALUES(3,3);

INSERT INTO student_to_subject(student_id)
VALUES(4);